# Part 1: Data Cleaning

In [17]:
import pandas as pd

In [18]:
data_unclean = pd.read_csv("resources/data-unclean.csv")
print(data_unclean.shape)
data_unclean.head()

(67558, 14)

,yr,mo,dy,date,st,mag,inj,fat,slat,slon,elat,elon,len,wid
0,1950,1,3,1950-01-03,IL,3,3,0,39.10,-89.30,39.12,-89.23,3.6,130
1,1950,1,3,1950-01-03,MO,3,3,0,38.77,-90.22,38.83,-90.03,9.5,150
2,1950,1,3,1950-01-03,OH,1,1,0,40.88,-84.58,0.00,0.00,0.1,10
3,1950,1,13,1950-01-13,AR,3,1,1,34.40,-94.37,0.00,0.00,0.6,17
4,1950,1,25,1950-01-25,IL,2,0,0,41.17,-87.33,0.00,0.00,0.1,100

## Dropping columns

In [19]:
data_unclean = data_unclean.drop(["mo", "dy", "len", "wid", "elat", "elon"], axis=1)
print(data_unclean.shape)
data_unclean.head()

(67558, 8)

     yr        date  st  mag  inj  fat   slat   slon
0  1950  1950-01-03  IL    3    3    0  39.10 -89.30
1  1950  1950-01-03  MO    3    3    0  38.77 -90.22
2  1950  1950-01-03  OH    1    1    0  40.88 -84.58
3  1950  1950-01-13  AR    3    1    1  34.40 -94.37
4  1950  1950-01-25  IL    2    0    0  41.17 -87.33

## Renaming columns

In [25]:
data_unclean = data_unclean.rename(columns={
    "yr": "year",
    "st": "state",
    "mag": "magnitude",
    "inj": "injuries",
    "fat": "fatalities",
    "slat": "latitude",
    "slon": "longitude"
})
print(data_unclean.shape)
data_unclean.head()

(67558, 8)

   year       date state  magnitude  injuries  fatalities  latitude  longitude
0  1950 1950-01-03    IL          3         3           0     39.10     -89.30
1  1950 1950-01-03    MO          3         3           0     38.77     -90.22
2  1950 1950-01-03    OH          1         1           0     40.88     -84.58
3  1950 1950-01-13    AR          3         1           1     34.40     -94.37
4  1950 1950-01-25    IL          2         0           0     41.17     -87.33

## Checking types

In [21]:
data_unclean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67558 entries, 0 to 67557
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        67558 non-null  int64
 1   date        67558 non-null  object
 2   state       67558 non-null  object
 3   magnitude   67558 non-null  int64
 4   injuries    67558 non-null  int64
 5   fatalities  67558 non-null  int64
 6   latitude    67558 non-null  float64
 7   longitude   67558 non-null  float64
dtypes: float64(2), int64(4), object(2)
memory usage: 4.1+ MB

In [22]:
data_unclean["date"] = pd.to_datetime(data_unclean["date"])

In [23]:
data_unclean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67558 entries, 0 to 67557
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        67558 non-null  int64
 1   date        67558 non-null  datetime64[ns]
 2   state       67558 non-null  object
 3   magnitude   67558 non-null  int64
 4   injuries    67558 non-null  int64
 5   fatalities  67558 non-null  int64
 6   latitude    67558 non-null  float64
 7   longitude   67558 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(4), object(1)
memory usage: 4.1+ MB

## Saving data

In [24]:
data_unclean.to_csv("resources/data.csv", index=False)